# frozen_string_literal: true

# vi:ft=ruby:
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "aws/tap"
tap "homebrew/cask-versions"

# Utils
brew "ag"
brew "asdf"
brew "aws-sam-cli"
brew "bat"
brew "cmake"
brew "direnv"
brew "efm-langserver"
brew "elixir"
brew "entr"
brew "eza"
brew "wyne/tap/fasder"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "fzf"
brew "gh"
# brew "gdb" not available on apple silicon
brew "git"
brew "gnupg"
brew "golang"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lima"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "pyenv"
brew "qemu"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "switchaudio-osx"
brew "tldr"
brew "tmux"
brew "tree"
brew "unison"
brew "autozimu/homebrew-formulas/unison-fsmonitor"
brew "universal-ctags"
brew "watch"
brew "wget"
brew "yaml-language-server"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zlib"
brew "colima"
brew "docker"

# Garbage Heap?
# brew "awscli"
# brew "gnupg21"
# brew "docker"
# brew "docker-compose"
# brew "docker-machine"
# brew "willgit"

# Applications
cask "alacritty"
cask "dash"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "obsidian"
cask "rowanj-gitx"
cask "sequel-pro"
cask "slack"
cask "transmission"
cask "vagrant"
cask "virtualbox"
cask "xquartz"
cask "zoom"

# Garbage Heap?
# cask "psequel"
# cask "osxfuse"
# cask "macfuse"
